<?php

declare(strict_types=1);

/**
 * @api {get} /api/v1/comments [GET] comments
 * @apiVersion 1.0.0
 * @apiName Get comments
 * @apiDescription Get comments
 * @apiGroup comments
 *
 * @apiQuery {Number{440000001-999999999}} phone Phone number (pn)
 * @apiQuery {Number=0,1} [c] Cache
 *
 * @apiSuccessExample {json} Success result:
 * HTTP/1.1 200 OK
 * {
 *   "pn": "067 234-14-56",
 *   "cache": true,
 *   "comments": [
 *     "Колцентр Київстар. дякую за професійну консультацію.",
 *     "Київстар руський колцентр... Акції. Норм. Дякую)",
 *     "Київстар . акційні тарифи. скористалася, прикольно.",
 *     "відділ менеджерів по підключенню, опрацювання питань по нових підключеннях, консультації по тарифах. Київстар. норм. дякую",
 *     "Домашній інтернет, все ок. скористалася .... дякую за професійну консультацію.",
 *     "Колцентр Київстар. вигідні тарифи домашній інтернет. Скористався все ок.",
 *     "Домашній інтернет від Київстар, вигідно, рекомендую)",
 *     "домашній інтернет київстар . нормально все. користуюся",
 *     "Київстар вигідні умови",
 *     "нові тарифи від КИЇВСТАР. СКОРИСТАВСЯ ВСЕ ОК.)",
 *     "інтернет від Київстар. актуальні пропозиції по номеру телефона. . все ок) дякую",
 *     "Домашній інтернет від Київстар. актуальні пропозиції по номеру телефона. Скористався. все ок)",
 *     "Дегродные люди с интелектом ниже плинтуса",
 *     "Київстар, домашній інтернет",
 *     "спам",
 *     "Киевстар впаривает услуги . Мошенники сама компания",
 *     "Киевстар интернет",
 *     "Інтернет провайдер"
 *   ]
 * }
 *
 * @apiErrorExample {json} Validation error:
 * HTTP/1.1 422 Unprocessable Entity
 * {
 *   "error": {
 *     "validation": [
 *       {
 *         "attribute": "c",
 *         "info": "The c field must be true or false."
 *       },
 *       {
 *         "attribute": "pn",
 *         "info": "Not numeric phone number"
 *       }
 *     ]
 *   },
 *   "code": 422
 * }
 *
 */
