<?php

declare(strict_types=1);

/**
 * @api {get} /api/v1/comments_detailed [GET] comments_detailed
 * @apiVersion 1.0.0
 * @apiName Get detailed comments
 * @apiDescription Get detailed comments
 * @apiGroup comments
 *
 * @apiQuery {Number{440000001-999999999}} phone Phone number (pn)
 *
 * @apiSuccessExample {json} Success result:
 * HTTP/1.1 200 OK
 * {
 *   "pn": "067 234-14-56",
 *   "comments": [
 *     "Колцентр Київстар. дякую за професійну консультацію.",
 *     "Київстар руський колцентр... Акції. Норм. Дякую)",
 *     "Київстар . акційні тарифи. скористалася, прикольно.",
 *     "відділ менеджерів по підключенню, опрацювання питань по нових підключеннях, консультації по тарифах. Київстар. норм. дякую",
 *     "Домашній інтернет, все ок. скористалася .... дякую за професійну консультацію.",
 *     "Колцентр Київстар. вигідні тарифи домашній інтернет. Скористався все ок.",
 *     "Домашній інтернет від Київстар, вигідно, рекомендую)",
 *     "домашній інтернет київстар . нормально все. користуюся",
 *     "Київстар вигідні умови",
 *     "нові тарифи від КИЇВСТАР. СКОРИСТАВСЯ ВСЕ ОК.)",
 *     "інтернет від Київстар. актуальні пропозиції по номеру телефона. . все ок) дякую",
 *     "Домашній інтернет від Київстар. актуальні пропозиції по номеру телефона. Скористався. все ок)",
 *     "Дегродные люди с интелектом ниже плинтуса",
 *     "Київстар, домашній інтернет",
 *     "спам",
 *     "Киевстар впаривает услуги . Мошенники сама компания",
 *     "Киевстар интернет",
 *     "Інтернет провайдер"
 *   ],
 *   "providers": [
 *     {
 *       "name": "telefonnyjdovidnyk.com.ua",
 *       "url": "https://www.telefonnyjdovidnyk.com.ua/nomer/0672341456",
 *       "code": "TD",
 *       "comments": [
 *         "Колцентр Київстар. дякую за професійну консультацію.",
 *         "Київстар руський колцентр... Акції. Норм. Дякую)",
 *         "Київстар . акційні тарифи. скористалася, прикольно.",
 *         "відділ менеджерів по підключенню, опрацювання питань по нових підключеннях, консультації по тарифах. Київстар. норм. дякую",
 *         "Домашній інтернет, все ок. скористалася .... дякую за професійну консультацію.",
 *         "Колцентр Київстар. вигідні тарифи домашній інтернет. Скористався все ок.",
 *         "Домашній інтернет від Київстар, вигідно, рекомендую)",
 *         "домашній інтернет київстар . нормально все. користуюся",
 *         "Київстар вигідні умови",
 *         "нові тарифи від КИЇВСТАР. СКОРИСТАВСЯ ВСЕ ОК.)",
 *         "інтернет від Київстар. актуальні пропозиції по номеру телефона. . все ок) дякую",
 *         "Домашній інтернет від Київстар. актуальні пропозиції по номеру телефона. Скористався. все ок)",
 *         "Дегродные люди с интелектом ниже плинтуса",
 *         "Київстар, домашній інтернет",
 *         "спам",
 *         "Киевстар впаривает услуги . Мошенники сама компания",
 *         "Киевстар интернет"
 *       ],
 *       "error": null
 *     },
 *     {
 *       "name": "ktozvonil.net",
 *       "url": "https://ktozvonil.net/nomer/0672341456",
 *       "code": "KZ",
 *       "comments": [
 *         "Інтернет провайдер"
 *       ],
 *       "error": null
 *     },
 *     {
 *       "name": "callinsider.com.ua",
 *       "url": "https://www.callinsider.com.ua/ua/0672341456",
 *       "code": "CI",
 *       "comments": [
 *         "Колцентр Київстар. дякую за професійну консультацію.",
 *         "Київстар руський колцентр... Акції. Норм. Дякую)",
 *         "Київстар . акційні тарифи. скористалася, прикольно.",
 *         "відділ менеджерів по підключенню, опрацювання питань по нових підключеннях, консультації по тарифах. Київстар. норм. дякую",
 *         "Домашній інтернет, все ок. скористалася .... дякую за професійну консультацію.",
 *         "Колцентр Київстар. вигідні тарифи домашній інтернет. Скористався все ок.",
 *         "Домашній інтернет від Київстар, вигідно, рекомендую)",
 *         "домашній інтернет київстар . нормально все. користуюся",
 *         "Київстар вигідні умови",
 *         "нові тарифи від КИЇВСТАР. СКОРИСТАВСЯ ВСЕ ОК.)",
 *         "інтернет від Київстар. актуальні пропозиції по номеру телефона. . все ок) дякую",
 *         "Домашній інтернет від Київстар. актуальні пропозиції по номеру телефона. Скористався. все ок)",
 *         "Дегродные люди с интелектом ниже плинтуса",
 *         "Київстар, домашній інтернет",
 *         "спам"
 *       ],
 *       "error": null
 *     },
 *     {
 *       "name": "slick.ly",
 *       "url": "https://slick.ly/ua/0672341456",
 *       "code": "SL",
 *       "comments": [
 *
 *       ],
 *       "error": {
 *         "message": "Client error: `GET https://slick.ly/ua/0672341456` resulted in a `403 Forbidden` response:\nerror code: 1006\n",
 *         "code": 403
 *       }
 *     },
 *     {
 *       "name": "kto-zvonil.com.ua",
 *       "url": "http://kto-zvonil.com.ua/number/067/2341456",
 *       "code": "KC",
 *       "comments": [
 *
 *       ],
 *       "error": null
 *     },
 *     {
 *       "name": "callfilter.app",
 *       "url": "https://callfilter.app/380672341456",
 *       "code": "CF",
 *       "comments": [
 *
 *       ],
 *       "error": null
 *     }
 *   ]
 * }
 *
 * @apiErrorExample {json} Validation error:
 * HTTP/1.1 422 Unprocessable Entity
 * {
 *   "error": {
 *     "validation": [
 *       {
 *         "attribute": "pn",
 *         "info": "Not numeric phone number"
 *       }
 *     ]
 *   },
 *   "code": 422
 * }
 */
